RIET/src/Catalogs/CountriesOfProcessLevels/CountriesOfProcessLevels.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CountriesOfProcessLevels</name>
  <predefined>
    <items>
      <name>AZ</name>
      <description>Azerbaijan</description>
    </items>
    <items>
      <name>BY</name>
      <description>Belarus</description>
    </items>
    <items>
      <name>GE</name>
      <description>Georgia</description>
    </items>
    <items>
      <name>KZ</name>
      <description>Kazakhstan</description>
    </items>
    <items>
      <name>RU</name>
      <description>Russia</description>
    </items>
    <items>
      <name>TM</name>
      <description>Turkmenistan</description>
    </items>
    <items>
      <name>UZ</name>
      <description>Uzbekistan</description>
    </items>
  </predefined>
  <attributes>
    <name>TMSID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NameForMoveIT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/CountriesOfProcessLevels/ManagerModule.bsl
Функция ПолучитьПоTMSID(TMSID) Экспорт
	
	Возврат РГСофт.НайтиСсылку("Справочник", "CountriesOfProcessLevels", "TMSID", TMSID);
	
КонецФункции

Функция ПолучитьМестнуюВалюту(Country) Экспорт
	
	Если Country = Справочники.CountriesOfProcessLevels.RU Тогда 
		
		Возврат Справочники.Валюты.НайтиПоКоду("643");
		
	ИначеЕсли Country = Справочники.CountriesOfProcessLevels.KZ Тогда 
		
		Возврат Справочники.Валюты.НайтиПоНаименованию("KZT");
		
	ИначеЕсли Country = Справочники.CountriesOfProcessLevels.AZ Тогда 
		
		ВалютаAZ = Справочники.Валюты.НайтиПоНаименованию("AZM");
		Если Не ЗначениеЗаполнено(ВалютаAZ) Тогда 
			ВалютаAZ = Справочники.Валюты.НайтиПоНаименованию("AZN");
		КонецЕсли;
		
		Возврат ВалютаAZ;
		
	ИначеЕсли Country = Справочники.CountriesOfProcessLevels.TM Тогда 
		
		Возврат Справочники.Валюты.НайтиПоНаименованию("TMT");
		
	ИначеЕсли Country = Справочники.CountriesOfProcessLevels.UZ Тогда 
		
		Возврат Справочники.Валюты.НайтиПоНаименованию("UZS");
		
	ИначеЕсли Country = Справочники.CountriesOfProcessLevels.GE Тогда 
		
		Возврат Справочники.Валюты.НайтиПоНаименованию("GEL");
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;

КонецФункции
